<?php 

//登录、注册页面是否使用SSL
$enable_ssl=false;

//SSL跳转到的域名，须绑定LLSP所在网站
$ssl_domain='www.your-domain.com';

//是否允许注册
$allow_reg=true;

//【未完工，不会判断，强制弹窗注册】注册类型：true=弹窗注册 false=游戏内注册，游戏内注册的UID将从最大的UID处开始递增分配
$enable_web_reg=true;

//新用户是否禁用卡片
$disable_card_by_default=true;

//新用户是否送全套卡片
$all_card_by_default=true;

//弹窗注册初始卡组列表
$default_deck_web=[50, 51, 52, 53, 49, 54, 55, 56, 57];

//游戏内注册初始卡组列表
$default_deck=[
  [13, 9, 8, 23, 49, 24, 21, 20, 19],
  [13, 9, 8, 23, 50, 24, 21, 20, 19],
  [13, 9, 8, 23, 51, 24, 21, 20, 19],
  [13, 9, 8, 23, 52, 24, 21, 20, 19],
  [13, 9, 8, 23, 53, 24, 21, 20, 19],
  [13, 9, 8, 23, 54, 24, 21, 20, 19],
  [13, 9, 8, 23, 55, 24, 21, 20, 19],
  [13, 9, 8, 23, 56, 24, 21, 20, 19],
  [13, 9, 8, 23, 57, 24, 21, 20, 19]
];